let joke  = document.querySelector("#joke");
let btn  = document.querySelector("#btn");
const jokeUrl= "https://v2.jokeapi.dev/joke/Any?blacklistFlags=nsfw,religious,political,racist,sexist,explicit&type=single";

const url = [
{
  name: `टीचर- इतने दिन कहां थे, स्कूल क्यों नहीं आए?

  गोलू- बर्ड फ्लू हो गया था मैम।
  
  टीचर- पर ये तो पक्षियों को होता है इंसानों को नहीं।
  
  गोलू- इंसान समझा ही कहां आपने...रोज तो मुर्गा बना देती हो..!!`
},
{
  name: `लडका : मैं उस लडकी से शादी करुंगा,
  जो मेहनती हो,
  सादगी से रहती हो,
  घर को संवारकर रखती हो,
  आज्ञाकारी हो।
  प्रेमिका: मेरे घर आ जाना,
  ये सारे गुण मेरी नौकरानी में है`
},
{
  name: `एक भिखारी को 100 का नोट मिला
  वो फाइव स्टार होटेल में गया और भरपेट खाना खाया
  1500 रुपये का बिल आया, उसने मेनेजर से कहा, पैसे तो नहीं है
  मैनेजर ने पुलिस के हवाले कर दिया
  भिखारी ने पुलिस को 100 का नोट दिया, और छूट गया
  इसे कहते हैं...
  फाइनेन्सियल मैनेजमेन्ट विदाउट एमबीए इन इंडिया`
},
{
  name: `एक भिखारी को 100 का नोट मिला
  वो फाइव स्टार होटेल में गया और भरपेट खाना खाया
  1500 रुपये का बिल आया, उसने मेनेजर से कहा, पैसे तो नहीं है
  मैनेजर ने पुलिस के हवाले कर दिया
  भिखारी ने पुलिस को 100 का नोट दिया, और छूट गया
  इसे कहते हैं...
  फाइनेन्सियल मैनेजमेन्ट विदाउट एमबीए इन इंडिया`
},
{
  name: `महिला- डॉक्टर साहब, मेरे पति नींद में
  बातें करने लगे हैं! क्या करूँ?
  डॉक्टर- उन्हें दिन में बोलने का
  मौका दीजिए!`
},
{
  name: `एक भिखारी को 100 का नोट मिला
  वो फाइव स्टार होटेल में गया और भरपेट खाना खाया
  1500 रुपये का बिल आया, उसने मेनेजर से कहा, पैसे तो नहीं है
  मैनेजर ने पुलिस के हवाले कर दिया
  भिखारी ने पुलिस को 100 का नोट दिया, और छूट गया
  इसे कहते हैं...
  फाइनेन्सियल मैनेजमेन्ट विदाउट एमबीए इन इंडिया`
},
{
    name: `पप्पू अपनी पत्नी से-
    अच्छा ये बताओ 'बिदाई' के समय तुम 
    लड़कियां इतनी रोती क्यों हो?
    पत्नी- 'पागल' अगर तुझे पता चले...
    अपने घर से दूर ले जाकर कोई तुमसे 
    'बर्तन मंजवाएगा' तो तू क्या नाचेगा...`
},{
    name:`पप्पू- क्या तुमको पता है कि मंदिर में पुरुष ही पुजारी क्यों होते है

    चप्पू- नहीं यार तुम ही बता दो
    
    गप्पू- मुझे पता है मैं बताता हूं
    
    गप्पू- ताकि, लोग सिर्फ भगवान पर
    ध्यान दे सकें`
},{
    name:`टीचर- लड़कियां अगर पराया धन
    होती है तो लड़के क्या होते है??
    
    गप्पू- सर चोर होते है!
    
    टीचर – वो कैसे??
    
    गप्पू- क्योकि चोरों की नजर
    हमेशा पराये धन पर होती है।`
},{
    name:`हसबैंड – डार्लिंग तुम खुबसूरत होती जा रही हो,
    पत्नी किचन से- तुमने कैसे जाना ?
    हसबैंड- तुम्हें देखकर तो अब रोटियां भी जलने लगी हैं।`
},{
    name:`टीचर- Date और तारीख में क्या
    अंतर है ?
    सारी Class चुप
    गप्पू- सर, Date में Girlfriend
    के साथ जाते है और
    तारीख में वकील के
    साथ`
},{
    name:`हसबैंड- आज ऐसी चाय बनाओ कि पीते ही
    तन बदन झूमने लगे और मन नाचने लगे।
    
    पत्नी- हमारे यहां भैंस का दूध आता है
    नागिन का नहीं।`
}
];



btn.addEventListener("click" , ()=>{

    // fetch(jokeUrl).then((response)=>{
    // return  response.json()
    // }).then((data)=> console.log(data.joke))
    const randomNumber = parseInt(Math.random() * (url.length - 0)) + 0;
    // console.log(url[randomNumber]);
    joke.classList.add("fade");
    joke.innerHTML = url[randomNumber].name;
})

